imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */

#include <string.h>
#include "lpc55s69/lpc55s69_mmio.h"
#include "lpc55s69/lpc55s69_romapi.h"
#include "lpc55s69/lpc55s69_hashcrypt.h"
#include "lpc55s69/lpc55s69_casper.h"
#include "lpc55s69/cpu_config.h"
#include "m33mu/memmap.h"
#include "m33mu/mmio.h"
#include "m33mu/nvic.h"

/* -------------------------------------------------------------------------
 * SYSCON  (0x40000000 NS, 0x50000000 S)
 * ------------------------------------------------------------------------- */
#define SYSCON_BASE      0x40000000u
#define SYSCON_SEC_BASE  0x50000000u
#define SYSCON_SIZE      0x1000u

/* SYSCON key register offsets */
#define SYSCON_PRESETCTRL0    0x100u
#define SYSCON_PRESETCTRL1    0x104u
#define SYSCON_PRESETCTRL2    0x108u
#define SYSCON_AHBCLKCTRL0    0x200u
#define SYSCON_AHBCLKCTRL1    0x204u
#define SYSCON_AHBCLKCTRL2    0x208u
#define SYSCON_MAINCLKSELA      0x280u
#define SYSCON_MAINCLKSELB      0x284u
#define SYSCON_SYSTICKCLKSEL0   0x260u
#define SYSCON_SYSTICKCLKSEL1   0x264u
#define SYSCON_CLOCK_CTRL       0xA18u

/* SET/CLR register arrays:
 *   PRESETCTRLSET[0..2] @ 0x120/0x124/0x128  → write ORs into PRESETCTRL[n]
 *   PRESETCTRLCLR[0..2] @ 0x140/0x144/0x148  → write AND-NOTs into PRESETCTRL[n]
 *   AHBCLKCTRLSET[0..2] @ 0x220/0x224/0x228  → write ORs into AHBCLKCTRL[n]
 *   AHBCLKCTRLCLR[0..2] @ 0x240/0x244/0x248  → write AND-NOTs into AHBCLKCTRL[n]
 */
#define SYSCON_PRESETCTRLSET_BASE 0x120u
#define SYSCON_PRESETCTRLCLR_BASE 0x140u
#define SYSCON_AHBCLKCTRLSET_BASE 0x220u
#define SYSCON_AHBCLKCTRLCLR_BASE 0x240u

struct syscon_state {
    mm_u32 regs[SYSCON_SIZE / 4u];
};

static struct syscon_state syscon;

static mm_bool syscon_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                           mm_u32 *value_out)
{
    struct syscon_state *s = (struct syscon_state *)opaque;
    if (s == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > SYSCON_SIZE)
        return MM_FALSE;
    memcpy(value_out, (mm_u8 *)s->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool syscon_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                            mm_u32 value)
{
    struct syscon_state *s = (struct syscon_state *)opaque;
    mm_u32 idx;
    if (s == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > SYSCON_SIZE)
        return MM_FALSE;

    /*
     * PRESETCTRLSET[0..2]: writes OR into PRESETCTRLn.
     * PRESETCTRLCLR[0..2]: writes AND-NOT into PRESETCTRLn.
     * AHBCLKCTRLSET[0..2]: writes OR into AHBCLKCTRLn.
     * AHBCLKCTRLCLR[0..2]: writes AND-NOT into AHBCLKCTRLn.
     * Only 32-bit accesses are meaningful; sub-word fall through to plain store.
     */
    if (size_bytes == 4u) {
        if (offset >= SYSCON_PRESETCTRLSET_BASE &&
            offset <  SYSCON_PRESETCTRLSET_BASE + 3u * 4u) {
            idx = (offset - SYSCON_PRESETCTRLSET_BASE) / 4u;
            s->regs[(SYSCON_PRESETCTRL0 / 4u) + idx] |= value;
            return MM_TRUE;
        }
        if (offset >= SYSCON_PRESETCTRLCLR_BASE &&
            offset <  SYSCON_PRESETCTRLCLR_BASE + 3u * 4u) {
            idx = (offset - SYSCON_PRESETCTRLCLR_BASE) / 4u;
            s->regs[(SYSCON_PRESETCTRL0 / 4u) + idx] &= ~value;
            return MM_TRUE;
        }
        if (offset >= SYSCON_AHBCLKCTRLSET_BASE &&
            offset <  SYSCON_AHBCLKCTRLSET_BASE + 3u * 4u) {
            idx = (offset - SYSCON_AHBCLKCTRLSET_BASE) / 4u;
            s->regs[(SYSCON_AHBCLKCTRL0 / 4u) + idx] |= value;
            return MM_TRUE;
        }
        if (offset >= SYSCON_AHBCLKCTRLCLR_BASE &&
            offset <  SYSCON_AHBCLKCTRLCLR_BASE + 3u * 4u) {
            idx = (offset - SYSCON_AHBCLKCTRLCLR_BASE) / 4u;
            s->regs[(SYSCON_AHBCLKCTRL0 / 4u) + idx] &= ~value;
            return MM_TRUE;
        }
    }

    memcpy((mm_u8 *)s->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * IOCON  (0x40001000 NS, 0x50001000 S)
 * ------------------------------------------------------------------------- */
#define IOCON_BASE     0x40001000u
#define IOCON_SEC_BASE 0x50001000u
#define IOCON_SIZE     0x100u

static mm_u32 iocon_regs[IOCON_SIZE / 4u];

static mm_bool iocon_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > IOCON_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)iocon_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool iocon_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                           mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > IOCON_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)iocon_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * GPIO  (0x4008C000 NS, 0x5008C000 S)
 * SECGPIO alias (0x400A8000 NS, 0x500A8000 S)
 *
 * LPC55S69 has 2 ports (64 pins total).
 * Register layout (offsets within the GPIO block):
 *   BYTE[0..63]  0x000..0x03F  byte-wide per-pin read/write
 *   WORD[0..63]  0x080..0x17F  word-wide per-pin read/write (bit 0 only)
 *   DIR[0..1]    0x2000, 0x2004
 *   MASK[0..1]   0x2080, 0x2084
 *   PIN[0..1]    0x2100, 0x2104
 *   MPIN[0..1]   0x2180, 0x2184
 *   SET[0..1]    0x2200, 0x2204  (write-only: OR into PIN)
 *   CLR[0..1]    0x2280, 0x2284  (write-only: AND-NOT into PIN)
 *   NOT[0..1]    0x2300, 0x2304  (write-only: XOR into PIN)
 *   DIRSET[0..1] 0x2380, 0x2384
 *   DIRCLR[0..1] 0x2400, 0x2404
 *   DIRNOT[0..1] 0x2480, 0x2484
 * ------------------------------------------------------------------------- */
#define GPIO_BASE      0x4008C000u
#define GPIO_SEC_BASE  0x5008C000u
#define SECGPIO_BASE     0x400A8000u
#define SECGPIO_SEC_BASE 0x500A8000u
#define GPIO_SIZE      0x2490u

