imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
#define GPIO_PORT_COUNT 2u
#define GPIO_PINS_PER_PORT 32u

#define GPIO_OFF_BYTE   0x000u
#define GPIO_OFF_WORD   0x080u
#define GPIO_OFF_DIR    0x2000u
#define GPIO_OFF_MASK   0x2080u
#define GPIO_OFF_PIN    0x2100u
#define GPIO_OFF_MPIN   0x2180u
#define GPIO_OFF_SET    0x2200u
#define GPIO_OFF_CLR    0x2280u
#define GPIO_OFF_NOT    0x2300u
#define GPIO_OFF_DIRSET 0x2380u
#define GPIO_OFF_DIRCLR 0x2400u
#define GPIO_OFF_DIRNOT 0x2480u

struct gpio_state {
    mm_u32 dir[GPIO_PORT_COUNT];
    mm_u32 pin[GPIO_PORT_COUNT];
    mm_u32 mask[GPIO_PORT_COUNT];
};

static struct gpio_state gpio;

static mm_bool gpio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    struct gpio_state *g = (struct gpio_state *)opaque;
    mm_u32 port;
    if (g == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE)
        return MM_FALSE;

    *value_out = 0;

    /* BYTE registers: byte-wide per-pin access */
    if (offset < GPIO_OFF_WORD) {
        mm_u32 pin_idx = offset;
        mm_u32 bit;
        if (pin_idx < (GPIO_PORT_COUNT * GPIO_PINS_PER_PORT)) {
            port = pin_idx / GPIO_PINS_PER_PORT;
            bit  = pin_idx % GPIO_PINS_PER_PORT;
            *value_out = (g->pin[port] >> bit) & 0x1u;
        }
        return MM_TRUE;
    }

    /* WORD registers: word-wide per-pin (bit 0) */
    if (offset >= GPIO_OFF_WORD && offset < GPIO_OFF_DIR) {
        mm_u32 pin_idx = (offset - GPIO_OFF_WORD) / 4u;
        mm_u32 bit;
        if (pin_idx < (GPIO_PORT_COUNT * GPIO_PINS_PER_PORT)) {
            port = pin_idx / GPIO_PINS_PER_PORT;
            bit  = pin_idx % GPIO_PINS_PER_PORT;
            *value_out = (g->pin[port] >> bit) & 0x1u;
        }
        return MM_TRUE;
    }

    /* Port-indexed registers */
    if (size_bytes == 4u) {
        if (offset >= GPIO_OFF_DIR && offset < GPIO_OFF_DIR + GPIO_PORT_COUNT * 4u) {
            port = (offset - GPIO_OFF_DIR) / 4u;
            *value_out = g->dir[port];
            return MM_TRUE;
        }
        if (offset >= GPIO_OFF_MASK && offset < GPIO_OFF_MASK + GPIO_PORT_COUNT * 4u) {
            port = (offset - GPIO_OFF_MASK) / 4u;
            *value_out = g->mask[port];
            return MM_TRUE;
        }
        if (offset >= GPIO_OFF_PIN && offset < GPIO_OFF_PIN + GPIO_PORT_COUNT * 4u) {
            port = (offset - GPIO_OFF_PIN) / 4u;
            *value_out = g->pin[port];
            return MM_TRUE;
        }
        if (offset >= GPIO_OFF_MPIN && offset < GPIO_OFF_MPIN + GPIO_PORT_COUNT * 4u) {
            port = (offset - GPIO_OFF_MPIN) / 4u;
            *value_out = g->pin[port] & ~g->mask[port];
            return MM_TRUE;
        }
        /* SET/CLR/NOT/DIRSET/DIRCLR/DIRNOT are write-only; reads return 0 */
    }

    return MM_TRUE;
}

static mm_bool gpio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    struct gpio_state *g = (struct gpio_state *)opaque;
    mm_u32 port;
    if (g == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE)
        return MM_FALSE;

    /* BYTE registers */
    if (offset < GPIO_OFF_WORD) {
        mm_u32 pin_idx = offset;
        mm_u32 bit;
        if (pin_idx < (GPIO_PORT_COUNT * GPIO_PINS_PER_PORT)) {
            port = pin_idx / GPIO_PINS_PER_PORT;
            bit  = pin_idx % GPIO_PINS_PER_PORT;
            if (value & 0x1u)
                g->pin[port] |= (1u << bit);
            else
                g->pin[port] &= ~(1u << bit);
        }
        return MM_TRUE;
    }

    /* WORD registers */
    if (offset >= GPIO_OFF_WORD && offset < GPIO_OFF_DIR) {
        mm_u32 pin_idx = (offset - GPIO_OFF_WORD) / 4u;
        mm_u32 bit;
        if (pin_idx < (GPIO_PORT_COUNT * GPIO_PINS_PER_PORT)) {
            port = pin_idx / GPIO_PINS_PER_PORT;
            bit  = pin_idx % GPIO_PINS_PER_PORT;
            if (value & 0x1u)
                g->pin[port] |= (1u << bit);
            else
                g->pin[port] &= ~(1u << bit);
        }
        return MM_TRUE;
    }

    if (size_bytes != 4u) return MM_TRUE;

    if (offset >= GPIO_OFF_DIR && offset < GPIO_OFF_DIR + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_DIR) / 4u;
        g->dir[port] = value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_MASK && offset < GPIO_OFF_MASK + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_MASK) / 4u;
        g->mask[port] = value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_PIN && offset < GPIO_OFF_PIN + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_PIN) / 4u;
        g->pin[port] = value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_MPIN && offset < GPIO_OFF_MPIN + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_MPIN) / 4u;
        g->pin[port] = (g->pin[port] & g->mask[port]) | (value & ~g->mask[port]);
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_SET && offset < GPIO_OFF_SET + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_SET) / 4u;
        g->pin[port] |= value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_CLR && offset < GPIO_OFF_CLR + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_CLR) / 4u;
        g->pin[port] &= ~value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_NOT && offset < GPIO_OFF_NOT + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_NOT) / 4u;
        g->pin[port] ^= value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_DIRSET && offset < GPIO_OFF_DIRSET + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_DIRSET) / 4u;
        g->dir[port] |= value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_DIRCLR && offset < GPIO_OFF_DIRCLR + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_DIRCLR) / 4u;
        g->dir[port] &= ~value;
        return MM_TRUE;
    }
    if (offset >= GPIO_OFF_DIRNOT && offset < GPIO_OFF_DIRNOT + GPIO_PORT_COUNT * 4u) {
        port = (offset - GPIO_OFF_DIRNOT) / 4u;
        g->dir[port] ^= value;
        return MM_TRUE;
    }

