imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * AHB_SECURE_CTRL  (0x400AC000 NS, 0x500AC000 S)
 *
 * Controls per-block security attributes for SRAM banks 0-4 (and flash/ROM).
 * MEM_RULE registers use 4-bit stride, 2-bit field per block:
 *   bits [1:0]  = RULE0, bits [5:4] = RULE1, ... bits [29:28] = RULE7
 *   Security bit = bit 1 of each field: 0 = non-secure, 1 = secure
 *
 * Reset value = 0x0 per SVD → all blocks non-secure at reset.
 * Firmware configures these registers during TrustZone initialisation.
 *
 * RAM bank → MEM_RULE register offsets (8 blocks per register):
 *   RAM0  (0x20000000, 64KB, 16 blocks): 0x60, 0x64
 *   RAM1  (0x20010000, 64KB, 16 blocks): 0x80, 0x84
 *   RAM2  (0x20020000, 64KB, 16 blocks): 0xA0, 0xA4
 *   RAM3  (0x20030000, 64KB, 16 blocks): 0xC0, 0xC4
 *   RAM4  (0x20040000, 16KB,  4 blocks): 0xE0
 *
 * Contiguous region (mpcbb_index=0) maps block_index linearly:
 *   blocks   0-15 → RAM0,  16-31 → RAM1,  32-47 → RAM2,
 *   blocks  48-63 → RAM3,  64-67 → RAM4
 * ------------------------------------------------------------------------- */
#define AHBSC_BASE      0x400AC000u
#define AHBSC_SEC_BASE  0x500AC000u
#define AHBSC_SIZE      0x1000u

/* Byte offsets of the first MEM_RULE register for each RAM bank */
static const mm_u32 ahbsc_ram_rule_base[5] = {
    0x60u,   /* RAM0 */
    0x80u,   /* RAM1 */
    0xA0u,   /* RAM2 */
    0xC0u,   /* RAM3 */
    0xE0u,   /* RAM4 */
};

static mm_u32 ahbsc_regs[AHBSC_SIZE / 4u];

static mm_bool ahbsc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > AHBSC_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)ahbsc_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool ahbsc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                           mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > AHBSC_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)ahbsc_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * FLASH controller  (0x40034000 NS, 0x50034000 S)
 *
 * Register layout (subset implemented):
 *   CMD        @ 0x000  write to launch command
 *   EVENT      @ 0x004  w1c event flags
 *   STARTA     @ 0x010  start address in 16-byte (ECC word) units
 *   STOPA      @ 0x014  stop address in 16-byte (ECC word) units
 *   DATAW[0-3] @ 0x080-0x08C  read/write data words
 *   INT_CLR_ENABLE @ 0xFD8
 *   INT_SET_ENABLE @ 0xFDC
 *   INT_STATUS     @ 0xFE0  bit0=FAIL bit1=ERR bit2=DONE bit3=ECC_ERR
 *   INT_ENABLE     @ 0xFE4
 *   INT_CLR_STATUS @ 0xFE8  w1c clears INT_STATUS
 *   INT_SET_STATUS @ 0xFEC  w1s sets INT_STATUS
 *   MODULE_ID      @ 0xFFC  read-only 0xC40F0800
 *
 * Flash commands (CMD field):
 *   4  Erase page    (512-byte aligned, STARTA = byte_addr / 16)
 *   5  Blank check   (STARTA..STOPA range, sets INT_STATUS)
 *   8  Write phrase  (16 bytes from DATAW[0-3] to STARTA * 16)
 * ------------------------------------------------------------------------- */
#define FLASH_CTRL_BASE     0x40034000u
#define FLASH_CTRL_SEC_BASE 0x50034000u
#define FLASH_CTRL_SIZE     0x1000u

#define FC_OFF_CMD          0x000u
#define FC_OFF_EVENT        0x004u
#define FC_OFF_STARTA       0x010u
#define FC_OFF_STOPA        0x014u
#define FC_OFF_DATAW0       0x080u
#define FC_OFF_DATAW3       0x08Cu
#define FC_OFF_INT_CLR_EN   0xFD8u
#define FC_OFF_INT_SET_EN   0xFDCu
#define FC_OFF_INT_STATUS   0xFE0u
#define FC_OFF_INT_ENABLE   0xFE4u
#define FC_OFF_INT_CLR_ST   0xFE8u
#define FC_OFF_INT_SET_ST   0xFECu
#define FC_OFF_MODULE_ID    0xFFCu

#define FC_INT_FAIL         (1u << 0)
#define FC_INT_ERR          (1u << 1)
#define FC_INT_DONE         (1u << 2)
#define FC_INT_ECC_ERR      (1u << 3)

#define FC_CMD_ERASE_PAGE   4u
#define FC_CMD_BLANK_CHECK  5u
#define FC_CMD_WRITE_PHRASE 8u

/* ECC word = 16 bytes = 4 DATAW registers */
#define FC_ECC_WORD_BYTES   16u
/* LPC55S69: 640 KB = 655360 bytes → 40960 ECC words → 5120 bitmap bytes */
#define FLASH_ECC_BITMAP_BYTES (LPC55S69_FLASH_SIZE / FC_ECC_WORD_BYTES / 8u)

static mm_u32 flash_ctrl_regs[FLASH_CTRL_SIZE / 4u];

/* One bit per ECC word; 1 = blank/erased (reads cause bus fault) */
static mm_u8 flash_blank_bits[FLASH_ECC_BITMAP_BYTES];
/* Pointer to the flash buffer (set by flash_bind) */
static mm_u8 *flash_buf = 0;

/* ---- Blank bitmap helpers ---- */

static void flash_blank_set(mm_u32 word_idx)
{
    flash_blank_bits[word_idx / 8u] |= (mm_u8)(1u << (word_idx % 8u));
}

static void flash_blank_clear(mm_u32 word_idx)
{
    flash_blank_bits[word_idx / 8u] &= (mm_u8)~(1u << (word_idx % 8u));
}

static mm_bool flash_blank_get(mm_u32 word_idx)
{
    return ((flash_blank_bits[word_idx / 8u] >> (word_idx % 8u)) & 1u) != 0u
           ? MM_TRUE : MM_FALSE;
}

/* Return the ECC word index for a byte offset within the flash buffer. */
static mm_u32 flash_word_idx(mm_u32 byte_offset)
{
    return byte_offset / FC_ECC_WORD_BYTES;
}

/* ---- Exported: mark flash range blank (erased) or programmed ---- */

void mm_lpc55s69_flash_mark_blank(mm_u32 offset, mm_u32 len)
{
    mm_u32 first = flash_word_idx(offset);
    mm_u32 last  = flash_word_idx((offset + len - 1u > offset) ? offset + len - 1u : offset);
    mm_u32 i;
    for (i = first; i <= last; ++i) {
        if (i < (LPC55S69_FLASH_SIZE / FC_ECC_WORD_BYTES)) {
            flash_blank_set(i);
        }
    }
}

void mm_lpc55s69_flash_mark_programmed(mm_u32 offset, mm_u32 len)
{
    mm_u32 first = flash_word_idx(offset);
    mm_u32 last  = flash_word_idx((offset + len - 1u > offset) ? offset + len - 1u : offset);
    mm_u32 i;
    for (i = first; i <= last; ++i) {
        if (i < (LPC55S69_FLASH_SIZE / FC_ECC_WORD_BYTES)) {
            flash_blank_clear(i);
        }
    }
}

/* ---- Flash controller CMD execution ---- */

static void flash_ctrl_exec_cmd(mm_u32 cmd)
{
    mm_u32 starta = flash_ctrl_regs[FC_OFF_STARTA / 4u] & 0x3FFFFu;
    mm_u32 stopa  = flash_ctrl_regs[FC_OFF_STOPA  / 4u] & 0x3FFFFu;
    mm_u32 flash_size_words = LPC55S69_FLASH_SIZE / FC_ECC_WORD_BYTES;
    mm_u32 status = FC_INT_DONE;
    mm_u32 i;

    if (starta >= flash_size_words) {
        flash_ctrl_regs[FC_OFF_INT_STATUS / 4u] |= FC_INT_DONE | FC_INT_FAIL;
        return;
    }
    if (stopa < starta) stopa = starta;
    if (stopa >= flash_size_words) stopa = flash_size_words - 1u;

    switch (cmd) {
    case FC_CMD_BLANK_CHECK:
        for (i = starta; i <= stopa; ++i) {
            if (!flash_blank_get(i)) {
                /* At least one word is not blank → FAIL */
                status |= FC_INT_FAIL;
                break;
            }
        }
        break;

    case FC_CMD_ERASE_PAGE: {
        /* Page = 512 bytes = 32 ECC words; starta is the start word index.
         * Erase the page that contains starta (round down to 32-word boundary). */
        mm_u32 page_start = (starta / 32u) * 32u;
        mm_u32 page_end   = page_start + 31u;
        if (flash_buf != 0) {
            memset(flash_buf + page_start * FC_ECC_WORD_BYTES, 0xFFu,
                   32u * FC_ECC_WORD_BYTES);
        }
        for (i = page_start; i <= page_end && i < flash_size_words; ++i) {
            flash_blank_set(i);
        }
        break;
    }

    case FC_CMD_WRITE_PHRASE:
        /* Write 16 bytes from DATAW[0-3] to STARTA * 16 in flash buffer. */
        if (flash_buf != 0 && starta < flash_size_words) {
            mm_u32 byte_off = starta * FC_ECC_WORD_BYTES;
            mm_u32 w;
            for (w = 0; w < 4u; ++w) {
                mm_u32 val = flash_ctrl_regs[(FC_OFF_DATAW0 / 4u) + w];
                flash_buf[byte_off + w * 4u + 0u] = (mm_u8)(val & 0xffu);
                flash_buf[byte_off + w * 4u + 1u] = (mm_u8)((val >> 8) & 0xffu);
                flash_buf[byte_off + w * 4u + 2u] = (mm_u8)((val >> 16) & 0xffu);
                flash_buf[byte_off + w * 4u + 3u] = (mm_u8)((val >> 24) & 0xffu);
            }
            flash_blank_clear(starta);
        }
        break;

    default:
        /* Unknown command — complete without error */
        break;
    }

    flash_ctrl_regs[FC_OFF_INT_STATUS / 4u] |= status;
}

