imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
static mm_bool flash_ctrl_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                               mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FLASH_CTRL_SIZE) return MM_FALSE;
    /* MODULE_ID is read-only */
    if (offset == FC_OFF_MODULE_ID && size_bytes == 4u) {
        *value_out = 0xC40F0800u;
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)flash_ctrl_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool flash_ctrl_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                                mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > FLASH_CTRL_SIZE) return MM_FALSE;
    /* MODULE_ID is read-only */
    if (offset == FC_OFF_MODULE_ID) return MM_TRUE;
    /* INT_CLR_STATUS: write 1 to clear INT_STATUS bits */
    if (offset == FC_OFF_INT_CLR_ST && size_bytes == 4u) {
        flash_ctrl_regs[FC_OFF_INT_STATUS / 4u] &= ~value;
        return MM_TRUE;
    }
    /* INT_SET_STATUS: write 1 to set INT_STATUS bits */
    if (offset == FC_OFF_INT_SET_ST && size_bytes == 4u) {
        flash_ctrl_regs[FC_OFF_INT_STATUS / 4u] |= value;
        return MM_TRUE;
    }
    /* Write register, then execute if CMD */
    memcpy((mm_u8 *)flash_ctrl_regs + offset, &value, size_bytes);
    if (offset == FC_OFF_CMD && size_bytes == 4u) {
        flash_ctrl_exec_cmd(value);
    }
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * PMC  (0x40020000 NS, 0x50020000 S)
 * Stub: tracks writes, returns stored values on read.
 * ------------------------------------------------------------------------- */
#define PMC_BASE      0x40020000u
#define PMC_SEC_BASE  0x50020000u
#define PMC_SIZE      0x100u

static mm_u32 pmc_regs[PMC_SIZE / 4u];

static mm_bool pmc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                        mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > PMC_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)pmc_regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool pmc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 value)
{
    (void)opaque;
    if (size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > PMC_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)pmc_regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * Generic pass-through stub for peripherals that need no active emulation.
 * Uses the opaque pointer to carry (size << 16 | ptr-identity); actual data
 * lives in a static array whose address is passed as opaque.
 * We embed the byte-size as the first word of the array, then the registers
 * follow — but that complicates array sizing.  Instead we use a lightweight
 * two-word wrapper.
 * ------------------------------------------------------------------------- */
struct periph_stub {
    mm_u32  size;      /* byte-size of the register space   */
    mm_u32 *regs;      /* pointer to the backing word array */
};

static mm_bool stub_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                         mm_u32 *value_out)
{
    const struct periph_stub *ps = (const struct periph_stub *)opaque;
    if (ps == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4u)
        return MM_FALSE;
    if ((offset + size_bytes) > ps->size) return MM_FALSE;
    memcpy(value_out, (const mm_u8 *)ps->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool stub_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                          mm_u32 value)
{
    struct periph_stub *ps = (struct periph_stub *)opaque;
    if (ps == 0 || size_bytes == 0 || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > ps->size) return MM_FALSE;
    memcpy((mm_u8 *)ps->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

/*
 * Declare a stub peripheral: static reg array + periph_stub descriptor.
 * NAME  – C identifier prefix
 * BYTES – byte-size of the register window (must be a multiple of 4)
 */
#define DECL_STUB(NAME, BYTES)                                  \
    static mm_u32 NAME##_regs[(BYTES) / 4u];                   \
    static struct periph_stub NAME##_stub = {                   \
        (BYTES), NAME##_regs                                    \
    }

/* Helper to register a stub at NS_BASE and S_BASE (S = NS + 0x10000000) */
static mm_bool stub_reg_pair(struct mmio_bus *bus,
                             struct periph_stub *ps,
                             mm_u32 ns_base)
{
    struct mmio_region reg;
    reg.size   = ps->size;
    reg.opaque = ps;
    reg.read   = stub_read;
    reg.write  = stub_write;
    reg.base   = ns_base;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base   = ns_base + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * GINT0  (0x40002000) — Group GPIO Interrupt
 * ------------------------------------------------------------------------- */
DECL_STUB(gint0, 0x48u);

/* -------------------------------------------------------------------------
 * PINT  (0x40004000) — Pin Interrupt / Pattern Match
 * ------------------------------------------------------------------------- */
DECL_STUB(pint, 0x34u);

/* -------------------------------------------------------------------------
 * INPUTMUX  (0x40006000) — Input Multiplexer
 * ------------------------------------------------------------------------- */
DECL_STUB(inputmux, 0x7C0u);   /* round 0x7B4 up to 4-byte boundary */

/* -------------------------------------------------------------------------
 * CTIMER0-4  — Counter/Timer (each 0x88 bytes)
 * 0x40008000 / 0x40009000 / 0x40028000 / 0x40029000 / 0x4002A000
 * ------------------------------------------------------------------------- */
DECL_STUB(ctimer0, 0x88u);
DECL_STUB(ctimer1, 0x88u);
DECL_STUB(ctimer2, 0x88u);
DECL_STUB(ctimer3, 0x88u);
DECL_STUB(ctimer4, 0x88u);

/* -------------------------------------------------------------------------
 * WWDT  (0x4000C000) — Windowed Watchdog Timer  (size 0x1C)
 * Reset values per SVD: TC=0xFF, TV=0xFF, WINDOW=0xFFFFFF
 * ------------------------------------------------------------------------- */
DECL_STUB(wwdt, 0x1Cu);
#define WWDT_OFF_TC     0x04u
#define WWDT_OFF_TV     0x0Cu
#define WWDT_OFF_WINDOW 0x18u

/* -------------------------------------------------------------------------
 * UTICK0  (0x4000E000) — Micro-tick Timer  (size 0x20)
 * ------------------------------------------------------------------------- */
DECL_STUB(utick0, 0x20u);

/* -------------------------------------------------------------------------
 * ANACTRL  (0x40013000) — Analog Control  (size 0x104)
 * Several read-only status registers reflect "hardware ready" at reset.
 * ------------------------------------------------------------------------- */
DECL_STUB(anactrl, 0x104u);
#define ANACTRL_ANALOG_CTRL_STATUS 0x04u  /* reset 0x50000000 — VDD/VBAT OK  */
#define ANACTRL_FRO192M_CTRL       0x10u  /* reset 0x80D01A                   */
#define ANACTRL_FRO192M_STATUS     0x14u  /* reset 0x3 — FRO on and stable    */
#define ANACTRL_XO32M_CTRL         0x20u  /* reset 0x21428A                   */
#define ANACTRL_BOD_DCDC_INT_STATUS 0x34u /* reset 0x104                      */
#define ANACTRL_RINGO0_CTRL        0x40u  /* reset 0x40                       */
#define ANACTRL_RINGO1_CTRL        0x44u  /* reset 0x40                       */
#define ANACTRL_RINGO2_CTRL        0x48u  /* reset 0x40                       */
#define ANACTRL_USBHS_PHY_CTRL     0x100u /* reset 0x8                        */

/* -------------------------------------------------------------------------
 * SYSCTL  (0x40023000) — System Controller  (size 0x104)
 * ------------------------------------------------------------------------- */
DECL_STUB(sysctl, 0x104u);

/* -------------------------------------------------------------------------
 * RTC  (0x4002C000) — Real-Time Clock  (size 0x60)
 * ------------------------------------------------------------------------- */
DECL_STUB(rtc, 0x60u);

/* -------------------------------------------------------------------------
 * OSTIMER  (0x4002D000) — OS Event Timer  (size 0x20)
 * ------------------------------------------------------------------------- */
DECL_STUB(ostimer, 0x20u);

/* -------------------------------------------------------------------------
 * PRINCE  (0x40035000) — PRINCE on-the-fly decryption  (size 0x40)
 * ------------------------------------------------------------------------- */
DECL_STUB(prince, 0x40u);

/* -------------------------------------------------------------------------
 * USBPHY  (0x40038000) — USB Physical Layer  (size 0x110)
 * ------------------------------------------------------------------------- */
DECL_STUB(usbphy, 0x110u);

/* -------------------------------------------------------------------------
 * RNG  (0x4003A000) — True Random Number Generator  (size 0x1000)
 * MODULEID @ 0xFFC = 0xA0B83200 (read-only peripheral ID)
 * ------------------------------------------------------------------------- */
DECL_STUB(rng, 0x1000u);
#define RNG_MODULEID 0xFFCu

/* -------------------------------------------------------------------------
 * PUF  (0x4003B000) — Physical Unclonable Function  (size 0x260)
 * Various registers have non-zero reset values.
 * ------------------------------------------------------------------------- */
DECL_STUB(puf, 0x260u);
#define PUF_STAT      0x020u  /* reset 0x1  — PUF ready */
#define PUF_PWRCTRL   0x108u  /* reset 0xF8               */
#define PUF_KEYLOCK   0x200u  /* reset 0xAA               */
#define PUF_KEYENABLE 0x204u  /* reset 0x55               */
#define PUF_IDXBLK_L  0x20Cu  /* reset 0x8000AAAA         */
#define PUF_IDXBLK_H_DP 0x210u /* reset 0xAAAA            */
#define PUF_IDXBLK_H  0x254u  /* reset 0x8000AAAA         */
#define PUF_IDXBLK_L_DP 0x258u /* reset 0xAAAA            */

/* -------------------------------------------------------------------------
 * PLU  (0x4003D000) — Programmable Logic Unit  (size 0xC20)
 * ------------------------------------------------------------------------- */
DECL_STUB(plu, 0xC20u);

/* -------------------------------------------------------------------------
 * DMA0  (0x40082000) — DMA Controller 0  (size 0x56C)
 * DMA1  (0x400A7000) — DMA Controller 1  (size 0x49C)
 * ------------------------------------------------------------------------- */
DECL_STUB(dma0, 0x56Cu);
DECL_STUB(dma1, 0x49Cu);

/* -------------------------------------------------------------------------
 * USB0  (0x40084000) — USB Full-Speed Device controller  (size 0x38)
 * USBHSD (0x40094000) — USB High-Speed Device controller (size 0x38)
 * USBFSH (0x400A2000) — USB Full-Speed Host              (size 0x60)
 * USBHSH (0x400A3000) — USB High-Speed Host              (size 0x54)
 * ------------------------------------------------------------------------- */
DECL_STUB(usb0, 0x38u);
DECL_STUB(usbhsd, 0x38u);
DECL_STUB(usbfsh, 0x60u);
DECL_STUB(usbhsh, 0x54u);

/* -------------------------------------------------------------------------
 * SCT0  (0x40085000) — State Configurable Timer/PWM  (size 0x550)
 * ------------------------------------------------------------------------- */
DECL_STUB(sct0, 0x550u);

/* -------------------------------------------------------------------------
 * MAILBOX  (0x4008B000) — Cortex-M33/M4 Mailbox  (size 0xFC)
 * ------------------------------------------------------------------------- */
DECL_STUB(mailbox, 0xFCu);

/* -------------------------------------------------------------------------
 * CRC_ENGINE  (0x40095000) — CRC Engine  (size 0xC)
 *
 * Registers (all at base + offset):
 *   [0x0] MODE  — polynomial selector + bit-reverse/complement flags
 *   [0x4] SEED  — writing resets the accumulator to this value
 *   [0x8] SUM   — reading returns current (post-processed) CRC
 *   [0x8] WR_DATA — writing feeds a byte/word through the CRC engine
 *
 * MODE bits:
 *   [1:0] CRC_POLY: 0=CRC-CCITT(0x1021,16b), 1=CRC-16(0x8005,16b), 2/3=CRC-32(0x04C11DB7,32b)
 *   [2]   BIT_RVS_WR: bit-reverse each input byte
 *   [3]   CMPL_WR: 1's-complement each input byte
 *   [4]   BIT_RVS_SUM: bit-reverse result
 *   [5]   CMPL_SUM: 1's-complement result
 * ------------------------------------------------------------------------- */
#define CRC_OFF_MODE   0x0u
#define CRC_OFF_SEED   0x4u
#define CRC_OFF_SUM    0x8u   /* read */
#define CRC_OFF_WRDATA 0x8u   /* write */

