imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
#define CRC_MODE_POLY_MASK    0x3u
#define CRC_MODE_BIT_RVS_WR  (1u << 2)
#define CRC_MODE_CMPL_WR     (1u << 3)
#define CRC_MODE_BIT_RVS_SUM (1u << 4)
#define CRC_MODE_CMPL_SUM    (1u << 5)

static mm_u32 crc_mode;
static mm_u32 crc_accum;  /* running accumulator */

static mm_u8 crc_bitrev8(mm_u8 b)
{
    b = (mm_u8)(((b >> 1u) & 0x55u) | ((b & 0x55u) << 1u));
    b = (mm_u8)(((b >> 2u) & 0x33u) | ((b & 0x33u) << 2u));
    b = (mm_u8)((b >> 4u) | (b << 4u));
    return b;
}

static mm_u32 crc_bitrev16(mm_u32 v)
{
    mm_u32 r = 0u, i;
    for (i = 0u; i < 16u; ++i) { r = (r << 1u) | (v & 1u); v >>= 1u; }
    return r;
}

static mm_u32 crc_bitrev32(mm_u32 v)
{
    mm_u32 r = 0u, i;
    for (i = 0u; i < 32u; ++i) { r = (r << 1u) | (v & 1u); v >>= 1u; }
    return r;
}

static void crc_feed_byte(mm_u8 b)
{
    mm_u32 poly, i;
    if (crc_mode & CRC_MODE_BIT_RVS_WR) b = crc_bitrev8(b);
    if (crc_mode & CRC_MODE_CMPL_WR)    b = (mm_u8)(~b);
    switch (crc_mode & CRC_MODE_POLY_MASK) {
    case 0u: /* CRC-CCITT: 0x1021, 16-bit */
        poly = 0x1021u;
        crc_accum ^= ((mm_u32)b << 8u);
        for (i = 0u; i < 8u; ++i) {
            if (crc_accum & 0x8000u) crc_accum = ((crc_accum << 1u) ^ poly) & 0xFFFFu;
            else                     crc_accum = (crc_accum << 1u) & 0xFFFFu;
        }
        break;
    case 1u: /* CRC-16: 0x8005, 16-bit */
        poly = 0x8005u;
        crc_accum ^= ((mm_u32)b << 8u);
        for (i = 0u; i < 8u; ++i) {
            if (crc_accum & 0x8000u) crc_accum = ((crc_accum << 1u) ^ poly) & 0xFFFFu;
            else                     crc_accum = (crc_accum << 1u) & 0xFFFFu;
        }
        break;
    default: /* CRC-32: 0x04C11DB7, 32-bit */
        poly = 0x04C11DB7u;
        crc_accum ^= ((mm_u32)b << 24u);
        for (i = 0u; i < 8u; ++i) {
            if (crc_accum & 0x80000000u) crc_accum = (crc_accum << 1u) ^ poly;
            else                         crc_accum = (crc_accum << 1u);
        }
        break;
    }
}

static mm_u32 crc_read_sum(void)
{
    mm_u32 v = crc_accum;
    int is32 = ((crc_mode & CRC_MODE_POLY_MASK) >= 2u);
    if (crc_mode & CRC_MODE_BIT_RVS_SUM) v = is32 ? crc_bitrev32(v) : crc_bitrev16(v);
    if (crc_mode & CRC_MODE_CMPL_SUM)    v = is32 ? (~v) : ((~v) & 0xFFFFu);
    return v;
}

static mm_bool crc_engine_read(void *opaque, mm_u32 offset, mm_u32 size,
                               mm_u32 *value_out)
{
    (void)opaque;
    if (size == 0u || size > 4u || value_out == 0) return MM_FALSE;
    switch (offset) {
    case CRC_OFF_MODE: *value_out = crc_mode;     return MM_TRUE;
    case CRC_OFF_SEED: *value_out = crc_accum;    return MM_TRUE;
    case CRC_OFF_SUM:  *value_out = crc_read_sum(); return MM_TRUE;
    default: *value_out = 0u; return MM_TRUE;
    }
}

static mm_bool crc_engine_write(void *opaque, mm_u32 offset, mm_u32 size,
                                mm_u32 value)
{
    (void)opaque;
    switch (offset) {
    case CRC_OFF_MODE:
        crc_mode = value & 0x3Fu;
        return MM_TRUE;
    case CRC_OFF_SEED:
        crc_accum = value;
        return MM_TRUE;
    case CRC_OFF_WRDATA: {
        mm_u32 i, nbytes = (size < 4u) ? size : 4u;
        for (i = 0u; i < nbytes; ++i) {
            crc_feed_byte((mm_u8)((value >> (8u * i)) & 0xFFu));
        }
        return MM_TRUE;
    }
    default: return MM_TRUE;
    }
}

static struct mmio_region crc_engine_ns_region;
static struct mmio_region crc_engine_s_region;

/* -------------------------------------------------------------------------
 * SDIF  (0x4009B000) — SD/MMC Interface  (size 0x300)
 * ------------------------------------------------------------------------- */
DECL_STUB(sdif, 0x300u);

/* -------------------------------------------------------------------------
 * DBGMAILBOX  (0x4009C000) — Debug Mailbox  (size 0x100)
 * ------------------------------------------------------------------------- */
DECL_STUB(dbgmailbox, 0x100u);

/* -------------------------------------------------------------------------
 * ADC0  (0x400A0000) — 16-bit Sigma-Delta ADC  (size 0x1000)
 * ------------------------------------------------------------------------- */
DECL_STUB(adc0, 0x1000u);

/* -------------------------------------------------------------------------
 * HASHCRYPT  (0x400A4000 NS, 0x500A4000 S) — Hash/AES-Crypt accelerator
 * Backed by mm_lpc55_hashcrypt; NVIC pointer wired in mm_lpc55s69_register_mmio.
 * ------------------------------------------------------------------------- */
static struct mm_lpc55_hashcrypt hashcrypt_state;
static struct mmio_region hashcrypt_ns_region;
static struct mmio_region hashcrypt_s_region;

/* -------------------------------------------------------------------------
 * CASPER  (0x400A5000 NS, 0x500A5000 S) — RSA/ECC accelerator (size 0x84)
 * Backed by mm_lpc55_casper; NVIC and memmap pointers wired at register time.
 * ------------------------------------------------------------------------- */
static struct mm_lpc55_casper casper_state;
static struct mmio_region casper_ns_region;
static struct mmio_region casper_s_region;

/* -------------------------------------------------------------------------
 * POWERQUAD  (0x400A6000) — DSP/Math accelerator  (size 0x260)
 * ------------------------------------------------------------------------- */
DECL_STUB(powerquad, 0x260u);

/* -------------------------------------------------------------------------
 * Public interface
 * ------------------------------------------------------------------------- */

/* PRESETCTRL offset = AHBCLKCTRL offset - 0x100 */
#define SYSCON_PRESETCTRL_BASE 0x100u
#define SYSCON_AHBCLKCTRL_BASE 0x200u

mm_bool mm_lpc55s69_syscon_periph_active(mm_u32 ahbclk_offset, mm_u32 bit)
{
    mm_u32 preset_offset;
    mm_u32 clk_reg;
    mm_u32 rst_reg;
    mm_u32 mask;

    if (ahbclk_offset < SYSCON_AHBCLKCTRL_BASE) return MM_FALSE;
    preset_offset = ahbclk_offset - 0x100u;  /* PRESETCTRLn at offset - 0x100 */
    if ((ahbclk_offset + 4u) > SYSCON_SIZE) return MM_FALSE;
    if ((preset_offset + 4u) > SYSCON_SIZE) return MM_FALSE;

    clk_reg = syscon.regs[ahbclk_offset / 4u];
    rst_reg = syscon.regs[preset_offset / 4u];
    mask = (1u << bit);
    /* Clock bit must be set; reset bit must be CLEAR (0 = released from reset). */
    return ((clk_reg & mask) != 0u && (rst_reg & mask) == 0u) ? MM_TRUE : MM_FALSE;
}

void mm_lpc55s69_mmio_reset(void)
{
    memset(&syscon, 0, sizeof(syscon));
    memset(&gpio, 0, sizeof(gpio));
    memset(iocon_regs, 0, sizeof(iocon_regs));
    memset(flash_ctrl_regs, 0, sizeof(flash_ctrl_regs));
    flash_ctrl_regs[FC_OFF_MODULE_ID / 4u] = 0xC40F0800u;
    memset(pmc_regs, 0, sizeof(pmc_regs));
    /* AHB_SECURE_CTRL: reset value 0 per SVD (all blocks non-secure) */
    memset(ahbsc_regs, 0, sizeof(ahbsc_regs));

    /* New peripheral stubs — clear all first, then set non-zero resets */
    memset(gint0_regs,       0, sizeof(gint0_regs));
    memset(pint_regs,        0, sizeof(pint_regs));
    memset(inputmux_regs,    0, sizeof(inputmux_regs));
    memset(ctimer0_regs,     0, sizeof(ctimer0_regs));
    memset(ctimer1_regs,     0, sizeof(ctimer1_regs));
    memset(ctimer2_regs,     0, sizeof(ctimer2_regs));
    memset(ctimer3_regs,     0, sizeof(ctimer3_regs));
    memset(ctimer4_regs,     0, sizeof(ctimer4_regs));
    memset(wwdt_regs,        0, sizeof(wwdt_regs));
    memset(utick0_regs,      0, sizeof(utick0_regs));
    memset(anactrl_regs,     0, sizeof(anactrl_regs));
    memset(sysctl_regs,      0, sizeof(sysctl_regs));
    memset(rtc_regs,         0, sizeof(rtc_regs));
    memset(ostimer_regs,     0, sizeof(ostimer_regs));
    memset(prince_regs,      0, sizeof(prince_regs));
    memset(usbphy_regs,      0, sizeof(usbphy_regs));
    memset(rng_regs,         0, sizeof(rng_regs));
    memset(puf_regs,         0, sizeof(puf_regs));
    memset(plu_regs,         0, sizeof(plu_regs));
    memset(dma0_regs,        0, sizeof(dma0_regs));
    memset(dma1_regs,        0, sizeof(dma1_regs));
    memset(usb0_regs,        0, sizeof(usb0_regs));
    memset(usbhsd_regs,      0, sizeof(usbhsd_regs));
    memset(usbfsh_regs,      0, sizeof(usbfsh_regs));
    memset(usbhsh_regs,      0, sizeof(usbhsh_regs));
    memset(sct0_regs,        0, sizeof(sct0_regs));
    memset(mailbox_regs,     0, sizeof(mailbox_regs));
    crc_mode  = 0u;
    crc_accum = 0u;
    memset(sdif_regs,        0, sizeof(sdif_regs));
    memset(dbgmailbox_regs,  0, sizeof(dbgmailbox_regs));
    memset(adc0_regs,        0, sizeof(adc0_regs));
    /* hashcrypt reset handled by mm_lpc55_hashcrypt_reset() below */
    /* casper reset handled by mm_lpc55_casper_reset() below */
    memset(powerquad_regs,   0, sizeof(powerquad_regs));

