imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
    /* WWDT non-zero resets */
    wwdt_regs[WWDT_OFF_TC     / 4u] = 0xFFu;
    wwdt_regs[WWDT_OFF_TV     / 4u] = 0xFFu;
    wwdt_regs[WWDT_OFF_WINDOW / 4u] = 0xFFFFFFu;

    /* ANACTRL: FRO and power-management status bits show hardware ready */
    anactrl_regs[ANACTRL_ANALOG_CTRL_STATUS  / 4u] = 0x50000000u;
    anactrl_regs[ANACTRL_FRO192M_CTRL        / 4u] = 0x0080D01Au;
    anactrl_regs[ANACTRL_FRO192M_STATUS      / 4u] = 0x3u;
    anactrl_regs[ANACTRL_XO32M_CTRL          / 4u] = 0x0021428Au;
    anactrl_regs[ANACTRL_BOD_DCDC_INT_STATUS / 4u] = 0x104u;
    anactrl_regs[ANACTRL_RINGO0_CTRL         / 4u] = 0x40u;
    anactrl_regs[ANACTRL_RINGO1_CTRL         / 4u] = 0x40u;
    anactrl_regs[ANACTRL_RINGO2_CTRL         / 4u] = 0x40u;
    anactrl_regs[ANACTRL_USBHS_PHY_CTRL      / 4u] = 0x8u;

    /* RNG peripheral ID */
    rng_regs[RNG_MODULEID / 4u] = 0xA0B83200u;

    /* PUF: enrolment-complete state and key-block configuration */
    puf_regs[PUF_STAT        / 4u] = 0x1u;
    puf_regs[PUF_PWRCTRL     / 4u] = 0xF8u;
    puf_regs[PUF_KEYLOCK     / 4u] = 0xAAu;
    puf_regs[PUF_KEYENABLE   / 4u] = 0x55u;
    puf_regs[PUF_IDXBLK_L    / 4u] = 0x8000AAAAu;
    puf_regs[PUF_IDXBLK_H_DP / 4u] = 0xAAAAu;
    puf_regs[PUF_IDXBLK_H    / 4u] = 0x8000AAAAu;
    puf_regs[PUF_IDXBLK_L_DP / 4u] = 0xAAAAu;

    /* PMC non-zero resets per SVD */
    pmc_regs[0x30u / 4u] = 0x47u;        /* BODVBAT */
    pmc_regs[0x50u / 4u] = 0xAu;         /* COMP    */
    pmc_regs[0x74u / 4u] = 0x6u;         /* STATUSCLK */
    pmc_regs[0x98u / 4u] = 0x3FF0008u;   /* RTCOSC32K */
    pmc_regs[0x9Cu / 4u] = 0x8u;         /* OSTIMER (PMC) */
    pmc_regs[0xB8u / 4u] = 0xDEFFC4u;    /* PDRUNCFG0 */

    /* SYSCON reset-state defaults per LPC55S69 SVD */
    syscon.regs[SYSCON_AHBCLKCTRL0 / 4u] = 0x00000180u;  /* FLASH + FMC */
    syscon.regs[SYSCON_AHBCLKCTRL1 / 4u] = 0x00000000u;
    syscon.regs[SYSCON_AHBCLKCTRL2 / 4u] = 0x00000000u;
    /* All resets asserted (0 = in reset) */
    syscon.regs[SYSCON_PRESETCTRL0 / 4u] = 0x00000000u;
    syscon.regs[SYSCON_PRESETCTRL1 / 4u] = 0x00000000u;
    syscon.regs[SYSCON_PRESETCTRL2 / 4u] = 0x00000000u;
    /* FRO12M as default main clock source */
    syscon.regs[SYSCON_MAINCLKSELA / 4u] = 0x0u;  /* FRO12M */
    syscon.regs[SYSCON_MAINCLKSELB / 4u] = 0x0u;  /* use MAINCLKSELA */
    /* SysTick clock selector reset = 7 (none / disabled) per SVD */
    syscon.regs[SYSCON_SYSTICKCLKSEL0 / 4u] = 0x7u;
    syscon.regs[SYSCON_SYSTICKCLKSEL1 / 4u] = 0x7u;
    /* CLOCK_CTRL: FRO1MHz enabled by default */
    syscon.regs[SYSCON_CLOCK_CTRL / 4u] = 0x1u;

    mm_lpc55s69_romapi_reset();
    mm_lpc55_hashcrypt_reset(&hashcrypt_state);
    mm_lpc55_casper_reset(&casper_state);
}

/*
 * Wire the NVIC into the HashCrypt peripheral model.
 * Called from mm_lpc55s69_timers_init (which already receives the NVIC).
 */
void mm_lpc55s69_set_nvic(struct mm_nvic *nvic)
{
    hashcrypt_state.nvic = nvic;
    casper_state.nvic    = nvic;
}

mm_bool mm_lpc55s69_casper_cp_active(void)
{
    /* Returns MM_TRUE whenever the CASPER instance has been initialised
     * (i.e. mm_lpc55s69_register_mmio has been called).  This is always
     * true for the LPC55S69 target and false for all other targets since
     * this function is never called for them. */
    return (mm_lpc55_casper_get_global() != NULL) ? MM_TRUE : MM_FALSE;
}

static mm_bool reg_pair(struct mmio_bus *bus, struct mmio_region *r,
                        mm_u32 ns_base, mm_u32 s_base)
{
    r->base = ns_base;
    if (!mmio_bus_register_region(bus, r)) return MM_FALSE;
    r->base = s_base;
    if (!mmio_bus_register_region(bus, r)) return MM_FALSE;
    return MM_TRUE;
}

mm_bool mm_lpc55s69_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    if (bus == 0) return MM_FALSE;

    /* SYSCON */
    reg.size   = SYSCON_SIZE;
    reg.opaque = &syscon;
    reg.read   = syscon_read;
    reg.write  = syscon_write;
    if (!reg_pair(bus, &reg, SYSCON_BASE, SYSCON_SEC_BASE)) return MM_FALSE;

    /* IOCON */
    reg.size   = IOCON_SIZE;
    reg.opaque = iocon_regs;
    reg.read   = iocon_read;
    reg.write  = iocon_write;
    if (!reg_pair(bus, &reg, IOCON_BASE, IOCON_SEC_BASE)) return MM_FALSE;

    /* GPIO */
    reg.size   = GPIO_SIZE;
    reg.opaque = &gpio;
    reg.read   = gpio_read;
    reg.write  = gpio_write;
    if (!reg_pair(bus, &reg, GPIO_BASE, GPIO_SEC_BASE)) return MM_FALSE;

    /* SECGPIO (alias of GPIO for secure access) */
    reg.size   = GPIO_SIZE;
    reg.opaque = &gpio;
    reg.read   = gpio_read;
    reg.write  = gpio_write;
    if (!reg_pair(bus, &reg, SECGPIO_BASE, SECGPIO_SEC_BASE)) return MM_FALSE;

    /* AHB_SECURE_CTRL */
    reg.size   = AHBSC_SIZE;
    reg.opaque = ahbsc_regs;
    reg.read   = ahbsc_read;
    reg.write  = ahbsc_write;
    if (!reg_pair(bus, &reg, AHBSC_BASE, AHBSC_SEC_BASE)) return MM_FALSE;

    /* FLASH controller */
    reg.size   = FLASH_CTRL_SIZE;
    reg.opaque = flash_ctrl_regs;
    reg.read   = flash_ctrl_read;
    reg.write  = flash_ctrl_write;
    if (!reg_pair(bus, &reg, FLASH_CTRL_BASE, FLASH_CTRL_SEC_BASE)) return MM_FALSE;

    /* PMC */
    reg.size   = PMC_SIZE;
    reg.opaque = pmc_regs;
    reg.read   = pmc_read;
    reg.write  = pmc_write;
    if (!reg_pair(bus, &reg, PMC_BASE, PMC_SEC_BASE)) return MM_FALSE;

    /* --- Generic stubs (address order) --- */
    if (!stub_reg_pair(bus, &gint0_stub,     0x40002000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &pint_stub,      0x40004000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &inputmux_stub,  0x40006000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &ctimer0_stub,   0x40008000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &ctimer1_stub,   0x40009000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &wwdt_stub,      0x4000C000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &utick0_stub,    0x4000E000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &anactrl_stub,   0x40013000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &sysctl_stub,    0x40023000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &ctimer2_stub,   0x40028000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &ctimer3_stub,   0x40029000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &ctimer4_stub,   0x4002A000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &rtc_stub,       0x4002C000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &ostimer_stub,   0x4002D000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &prince_stub,    0x40035000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &usbphy_stub,    0x40038000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &rng_stub,       0x4003A000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &puf_stub,       0x4003B000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &plu_stub,       0x4003D000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &dma0_stub,      0x40082000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &usb0_stub,      0x40084000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &sct0_stub,      0x40085000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &mailbox_stub,   0x4008B000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &usbhsd_stub,    0x40094000u)) return MM_FALSE;
    /* CRC_ENGINE — custom read/write handlers */
    crc_engine_ns_region.base   = 0x40095000u;
    crc_engine_ns_region.size   = 0xCu;
    crc_engine_ns_region.opaque = 0;
    crc_engine_ns_region.read   = crc_engine_read;
    crc_engine_ns_region.write  = crc_engine_write;
    if (!mmio_bus_register_region(bus, &crc_engine_ns_region)) return MM_FALSE;
    crc_engine_s_region = crc_engine_ns_region;
    crc_engine_s_region.base    = 0x50095000u;
    if (!mmio_bus_register_region(bus, &crc_engine_s_region)) return MM_FALSE;
    if (!stub_reg_pair(bus, &sdif_stub,      0x4009B000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &dbgmailbox_stub,0x4009C000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &adc0_stub,      0x400A0000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &usbfsh_stub,    0x400A2000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &usbhsh_stub,    0x400A3000u)) return MM_FALSE;
    /* HASHCRYPT — proper peripheral model */
    mm_lpc55_hashcrypt_init(&hashcrypt_state, NULL); /* NVIC wired later by timers_init */
    hashcrypt_ns_region.base   = 0x400A4000u;
    hashcrypt_ns_region.size   = 0xE0u;
    hashcrypt_ns_region.opaque = &hashcrypt_state;
    hashcrypt_ns_region.read   = mm_lpc55_hashcrypt_read;
    hashcrypt_ns_region.write  = mm_lpc55_hashcrypt_write;
    hashcrypt_ns_region.name   = "hashcrypt";
    if (!mmio_bus_register_region(bus, &hashcrypt_ns_region)) return MM_FALSE;
    hashcrypt_s_region = hashcrypt_ns_region;
    hashcrypt_s_region.base = 0x500A4000u;
    if (!mmio_bus_register_region(bus, &hashcrypt_s_region)) return MM_FALSE;
    /* CASPER — proper peripheral model */
    mm_lpc55_casper_init(&casper_state, NULL, NULL); /* NVIC/memmap wired later */
    mm_lpc55_casper_set_global(&casper_state);
    casper_ns_region.base   = 0x400A5000u;
    casper_ns_region.size   = CASPER_SIZE;
    casper_ns_region.opaque = &casper_state;
    casper_ns_region.read   = mm_lpc55_casper_read;
    casper_ns_region.write  = mm_lpc55_casper_write;
    casper_ns_region.name   = "casper";
    if (!mmio_bus_register_region(bus, &casper_ns_region)) return MM_FALSE;
    casper_s_region = casper_ns_region;
    casper_s_region.base = 0x500A5000u;
    if (!mmio_bus_register_region(bus, &casper_s_region)) return MM_FALSE;
    if (!stub_reg_pair(bus, &powerquad_stub, 0x400A6000u)) return MM_FALSE;
    if (!stub_reg_pair(bus, &dma1_stub,      0x400A7000u)) return MM_FALSE;

    /* ROM API — bootloader tree and stub execution region */
    if (!mm_lpc55s69_romapi_register_mmio(bus)) return MM_FALSE;

