imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_mmio.c
    return MM_TRUE;
}

/*
 * TrustZone memory block security query — called by the core to determine
 * whether a RAM block is secure.
 *
 * bank:        mpcbb_index from mm_ram_region (0 for our single region)
 * block_index: (addr - region_base_s_or_ns) / LPC55S69_MPCBB_BLOCK_SIZE
 *
 * Our single contiguous region covers SRAM0-4 linearly:
 *   blocks   0-15 → SRAM0  (AHB_SECURE_CTRL offsets 0x60, 0x64)
 *   blocks  16-31 → SRAM1  (0x80, 0x84)
 *   blocks  32-47 → SRAM2  (0xA0, 0xA4)
 *   blocks  48-63 → SRAM3  (0xC0, 0xC4)
 *   blocks  64-67 → SRAM4  (0xE0)
 *
 * Each MEM_RULE register holds 8 blocks at 4-bit stride:
 *   security bit = bit 1 of field = (reg >> (block_in_reg * 4 + 1)) & 1
 */
mm_bool mm_lpc55s69_mpcbb_block_secure(int bank, mm_u32 block_index)
{
    mm_u32 ram_bank;      /* which SRAM (0-4) */
    mm_u32 block_in_bank; /* block within that SRAM */
    mm_u32 rule_offset;   /* byte offset in ahbsc_regs of the rule register */
    mm_u32 block_in_reg;  /* which of the 8 rules within that register */
    mm_u32 reg_val;
    mm_u32 sec_bit;

    if (bank != 0) return MM_FALSE;

    /* 16 blocks per SRAM bank (except SRAM4 which has 4) */
    ram_bank      = block_index / 16u;
    block_in_bank = block_index % 16u;

    if (ram_bank > 4u) return MM_FALSE;
    /* SRAM4 has only 4 blocks (16 KB / 4 KB) */
    if (ram_bank == 4u && block_in_bank >= 4u) return MM_FALSE;

    rule_offset  = ahbsc_ram_rule_base[ram_bank] + (block_in_bank / 8u) * 4u;
    block_in_reg = block_in_bank % 8u;

    reg_val = ahbsc_regs[rule_offset / 4u];
    sec_bit = (reg_val >> (block_in_reg * 4u + 1u)) & 1u;
    return (sec_bit != 0u) ? MM_TRUE : MM_FALSE;
}

/* ---- ECC check callback installed into mm_memmap ---- */

static mm_bool lpc55s69_flash_ecc_check(void *opaque, mm_u32 byte_offset)
{
    mm_u32 word_idx = byte_offset / FC_ECC_WORD_BYTES;
    (void)opaque;
    if (word_idx >= (LPC55S69_FLASH_SIZE / FC_ECC_WORD_BYTES)) {
        return MM_FALSE;
    }
    /* blank → bus fault */
    return flash_blank_get(word_idx) ? MM_FALSE : MM_TRUE;
}

void mm_lpc55s69_flash_bind(struct mm_memmap *map,
                            mm_u8 *flash,
                            mm_u32 flash_size,
                            const struct mm_flash_persist *persist,
                            mm_u32 flags)
{
    mm_u32 n_words;
    mm_u32 i;
    mm_u32 j;
    mm_bool all_ff;

    (void)persist;
    (void)flags;

    flash_buf = flash;

    /* Wire the memory-map pointer into CASPER so it can read operands from RAM */
    casper_state.map = map;

    /*
     * Do NOT pre-mark factory-blank (0xFF) pages as ECC-faulting.
     * On real hardware, freshly-blank flash (factory state or after a proper
     * erase) returns 0xFF correctly; ECC faults only occur on inconsistent
     * (partially-written) words.  We track which words were explicitly erased
     * by the ROM API erase stub and only fault on those, matching the SDK
     * FLASH_VerifyErase() behaviour without breaking reads of unwritten flash.
     */
    memset(flash_blank_bits, 0, sizeof(flash_blank_bits));
    (void)n_words; (void)i; (void)j; (void)all_ff; (void)flash_size;

    mm_memmap_set_flash_ecc_check(map, lpc55s69_flash_ecc_check, 0);
}

mm_u64 mm_lpc55s69_cpu_hz(void)
{
    return 96000000ull; /* FRO96M default */
}
